Repository: GamemakerChina/GMS2_manual_en2ch
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: The exact contents of this window will depend on the platform specifics (see the section on the Device Manager for exact details for any given platform).
zh_cn: 此窗口的具体内容取决于平台（有关给定平台的详细信息，请参阅 设备管理器部分）。

source: The exact meaning of the returned "status" map entry is explained in the following table:
zh_cn: 返回值 "status" 的详细映射关系如下如下：

source: The exact procedure and requirements for setting up devices and troubleshooting issues can be found in the appropriate section of the GameMaker Studio 2 Knowledge Base.
zh_cn: 有关设置设备和故障排除的具体内容可以在 GameMaker Studio 2 知识库的相应章节中找到。

source: The example code below shows a typical use of this command in the draw event of an instance to check for a surface and re-create it if it has been removed (note that the surface will have been originally created in the create event of the object).
zh_cn: 下面是这个命令在实例绘制事件中检测表面图层的典型使用，如果发现被破坏了就会重新创建（注意，表面将在创建事件中提前创建好）。

source: The execution continues after the first case statement with the correct value, until a break statement is encountered.
zh_cn: 遇到第一个正确的值后运行会继续，直到出现一个“break”语句。.

source: The expression tests whether the loop should be ended.
zh_cn: 表达式测试是否结束循环。

source: The expression uses a symbol that is not part of the accepted expression symbol set - the symbol in question will be shown (for more information on expressions see here)
zh_cn: 表达式使用的符号不是被接受的表达式符号集的一部分——有问题的符号将显示出来（有关表达式的更多信息，请参阅 这里）

source: The external project file cannot be read to import this resource
zh_cn: 无法读取外部项目文件以导入此资源

source: The file '{0}' is not supported.
zh_cn: 不支持文件 '{0}' 。

source: The file is then sent to the cloud service for storage.
zh_cn: 该文件之后被提交到云端服务器中存储。

source: The file menu is where you can choose to change, save or import projects as well as set the GameMaker Studio 2 IDE preferences.
zh_cn: 在文件菜单中，你可以选择修改、保存以及导入项目，还可以设置GameMaker Studio 2 IDE（开发环境）的偏好设置。

source: The file that you tried to import is not supported in this editor.
zh_cn: 此编辑器不支持您尝试导入的文件。

source: The file to be uploaded (as a string).
zh_cn: 将被上传的文件(同i符串)。

source: The file(s) you attempted to load are not supported by the image editor.
zh_cn: 图像编辑器不支持您尝试加载的文件。

source: The file(s) you attempted to load are not supported by the sprite editor.
zh_cn: 精灵编辑器不支持您尝试加载的文件。

source: The filename for the screenshot to save
zh_cn: 屏幕截图保存的名称。

source: The final icon permits the debug window to update its data in real time, so you can see how variables change or instances are created and destroyed as it happens.
zh_cn: 最后的这个图标允许调试窗口实时更新数据，这样的话你就能看见变量如何改变或者实例如何生成与破坏的了。

source: The first angle to use.
zh_cn: 待使用的第一个角。

source: The first column of the Target Manager is dedicated to the Remote Workers that you have available.
zh_cn: 目标管理器的第一列用于显示您可用的远程工作者。

source: The first is when you don't add any code or DnD™ to the event, in which case it will "default draw" the sprite assigned, using any transforms that have been applied elsewhere in the object (like to change its size or alpha blending).
zh_cn: 首先是当你 不 添加任何代码或拖拽模块时，在这种情况下，它将“默认绘制”被分配的精灵，使用所有已应用在物体上的其他变换（如改变其大小或阿尔法混合）。

source: The first matrix index to use.
zh_cn: 所使用的第一个矩阵索引

source: The first statement initializes the for-loop.
zh_cn: 语句1初始化，用于循环。

source: The first thing you need know is how to set the origin for the sprite.
zh_cn: 你需要知道的第一件事是如何设置精灵的 原点。

source: The flag will be either true (enabled, the default value) or false (disabled).
zh_cn: 标识可以为 真 (允许，默认值) 或 假 (不允许)。

source: The following are the general options:
zh_cn: 下述为常规选项：

source: The following function all give you details about the size and orientation of the display, details about the GUI layer, and information on the mouse:
zh_cn: 接下来的函数会给你屏幕大小和方向的详细信息，也包括GUI层和鼠标上的内容或信息。

source: The following functions are available for local notifications:
zh_cn: 以下函数可用于本地通知:

source: The following image illustrates how this value corresponds to the HSV scale of colour:
zh_cn: 下面的图像说明了色彩的HSV数值是如何变化的：

source: The following image illustrates how this works:
zh_cn: 下面的图片说明了工作原理。

source: The following image illustrates this:
zh_cn: 下面的图像说明这一点:

source: The following option exists for Auto Tiling:
zh_cn: 自动贴图 存在以下选项：

source: The following option exists:
zh_cn: 存在以下选项：

source: The following options exist for setting paths to external editors:
zh_cn: 还有下列用于设定外部编辑器路径的选项：

source: The following options exist for the IDE:
zh_cn: 在IDE中有如下选项：

source: The following options exist:
zh_cn: 存在以下选项：

source: The following sub-category also exists for the Object Editor:
zh_cn: 物体编辑器还存在下面的子类别：

source: The following sub-category also exists for the Sprite Editor:
zh_cn: 精灵编辑器还有以下子目录：

source: The following two sections deal with these two aspects of displaying your game:
zh_cn: 以下各节处理显示游戏的两个方面：

source: The font {0} does not contain any character maps and cannot be loaded.
zh_cn: 字体 {0} 不包含任何字符映射并且不能载入。

source: The format for an extension will vary depending on the final target platform, although in general they are written in C++, C# or JavaScript, which is then parsed using specific functions in GML.
zh_cn: 扩展的格式将根据最终的目标平台而有所不同，一般它们采用C ++，C＃或 JavaScript 编写，然后使用 GML 中的 特定函数 来进行解析。

source: The full shader is comprised of a vertex shader program, and a fragment shader program (also known as a pixel shader).
zh_cn: 完整的着色器由顶点着色器程序和片段着色器程序（也称为像素着色器）组成。

source: The function or script being called is for acting on an instance, but at the time of running no instances exist
zh_cn: 调用的函数或脚本用于对实例执行操作，但在运行时不存在实例

source: The function will only work while the game is in focus and using alt + tab will unlock the mouse.
zh_cn: 这个函数只有焦点在游戏中时有用，所以使用 alt + tab时 将会解锁鼠标。

source: The function will return 0 if the variable given is not an array or is a 1D array.
zh_cn: 如果给定变量不是一个数组或者是一维数组时将会返回0.

source: The function will return a unique id value that should then be used in the appropriate asynchronous event to identify the ds_map that is returned as a "call back" from the cloud service.
zh_cn: 该函数将返回惟一的id 值，那么应该使用适当的异步事件识别 ds_map 返回作为云服务的“回调（call back）”。

source: The function will return an array with 8 values per display (ie: if you have two displays, the array will have a length of 16 indices), where the values [0 ... 3] correspond to the overlapx1, overlapy1, overlapx2, overlapy2 - defining the region of overlap on this display and will be set to 0,0,0,0 if no overlap - and the values [4 ... 7] corresponds to the monitorx1, monitory1, monitorx2, monitory2 - the coordinates of the display in the virtual display space.
zh_cn: 对于每个显示器，这个函数将返回8个值添加到一个数组中（比如你有两个显示器，数组长度将是16），值[0~3] 对应 overlapx1、 overlapy1、 overlapx2、 overlapy - 定义显示器里的重叠区域，如果无重叠，将设置为 0,0,0,0 - 值 [4~ 7] 对应 monitorx1、 monitory1、 monitorx2、 monitory2 - 它们是虚拟显示器空间上的坐标。

source: The function will return an array with four keys, where key 0 and 1 are the x and y position of the top lefthand corner of the surface, and keys 2 and 3 are the x and y of the bottom righthand corner of the surface, all relative to the size of the display or window.
zh_cn: 这个函数将返回包含四个键值的数组，键0和键1是表面左上角x/y的位置，键2和键3是表面右下x/y的位置，所有的这些值响应显示器及窗口发生变化。

source: The function will return the index of the surface which should be stored in a variable for future function calls.
zh_cn: 这个函数将返回表面的索引名称，并储存在一个变量上，方便将来函数调用。

source: The fundamental thing that makes a game a game is the interaction with the player.
zh_cn: 制作一个 游戏最根本的事件是与玩家交互。

source: The general settings are as follows:
zh_cn: 基本设置如下：

source: The given number - shown in the error - is not the correct format for the function or operation being performed, for example you supply an integer when a pointer is required (see the section on Data Types for more info)
zh_cn: （在错误中）给定的数字不是正在执行的函数或操作的正确格式，例如，当需要指针时，提供一个整形变量（更多相关信息请参阅 数据类型 ）

source: The height of the anchor points
zh_cn: 锚点的高度

source: The height of the area in the source surface to copy from.
zh_cn: 源表面层内，复制区域的高度。

source: The height of the area of the screen to capture
zh_cn: 捕捉屏幕区域的高度。

source: The height of the new surface.
zh_cn: 新的表面层的高度。

source: The height of the part to save.
zh_cn: 保存部分的高度。

source: The height of the surface to be created.
zh_cn: 创建的表面层的高度。

source: The helpfile is designed to operate like a web page and as such requires the use of the GameMaker Studio 2 micro web server, or the use of an external browser.
zh_cn: 帮助文档被设计成向网页那样的操作方式并且因此需要使用 GameMaker Studio 2 的微型网络服务器（Micro Web Server，MWS），或者也可以使用外部浏览器。

source: The highight colour for inherited tiles in the tile editor
zh_cn: 图块编辑器中继承图块的高亮颜色

source: The highight colour for mouse over tiles in the tile editor
zh_cn: 图块编辑器中鼠标悬浮图块的高亮颜色

source: The highight colour for selected tiles in the tile editor
zh_cn: 图块编辑器中选中的图块的高亮颜色

source: The highight colour for the current shift multi select area
zh_cn: 当前多选区域的高亮颜色

source: The host name or IP address
zh_cn: 主机名或IP地址

source: The host name or IP address the program is running on
zh_cn: 运行程序的主机名或IP地址

source: The id of the buffer to get the data from.
zh_cn: 待取数据的缓冲区id。

source: The id of the socket to remove.
zh_cn: 要移除的套接字id。

source: The id of the socket to use.
zh_cn: 所使用的套接字id。

source: The id of the view to compare the mouse position to.
zh_cn: 比较鼠标位置的视野的id。

source: The image below illustrates how this works:
zh_cn: 下图描绘了这是如何工作的：

source: The image below shows a simple DnD™ script that takes a single argument and uses that to create a number of instances at random positions within a room:
zh_cn: 下图展示了一个简单的DnD™脚本取得了一个参数，然后使用这个参数在房间内随机位置创建一些实例：

source: The image below shows an example of how these options affect the path:
zh_cn: 如下的图片展示了一些不同设置的路径的样例：

source: The image editor is a very powerful tool for creating the graphics in your game and is opened by clicking the Edit Image button.
zh_cn: 图像编辑器是一个用于在游戏中创建图形的强大工具，通过单击“编辑图像”按钮打开。

source: The image is expected to be of {0}x{1} but received {2}x{3}
zh_cn: 图像应为{0} x {1}，但收到{2} x {3}

source: The image is expected to have an alpha channel (i.e. be 32-bit)
zh_cn: 图像预计有一个alpha通道（即32位）

source: The image used doesn't have to be of a single static thing either... it can be a "strip" image too, ie: multiple images in a a single file which can then be used to make a single animated sprite.
zh_cn: 使用的图像不一定是单个静态图像，也可以是“条装”图像，即单个文件中含有多个图像，可用于制作一个动画精灵。

source: The index (type) of the particles to be created.
zh_cn: 所创建的粒子索引（类型）。

source: The index of the action that is currently being executed.
zh_cn: 当前要执行事件动作的索引。

source: The index of the array to check.
zh_cn: 待检测的数组索引。

source: The index of the destination grid.
zh_cn: 靶栅格的索引

source: The index of the emitter to burst from.
zh_cn: 要迸发粒子的发射器索引。

source: The index of the emitter to clear.
zh_cn: 要清空的发射器索引。

source: The index of the emitter to destroy.
zh_cn: 待销毁的发射器索引。

source: The index of the first array.
zh_cn: 第一个数组的句柄

source: The index of the font to delete.
zh_cn: 待删除的字体索引。

source: The index of the grid.
zh_cn: 栅格的索引

source: The index of the joint that you wish to delete
zh_cn: 你要删除的关节索引

source: The index of the object to check.
zh_cn: 待检测的物体索引。

source: The index of the second array.
zh_cn: 第二个数组的句柄

source: The index of the source grid.
zh_cn: 源栅格的索引

source: The information section of the Start Page permits you to browse the YoYo Games Marketplace as well as browse and open Tutorials and Demos made by the YoYo Games team to show off specific aspects of GameMaker Studio 2 (see below for more information).
zh_cn: 在起始页的信息部分允许您浏览 YoYo Games市场（YoYo Games Marketplace） 以及浏览和打开的YoYo Games团队关于GameMaker Studio 2 具体操作方面的教程（Tutorials）和演示项目（Demos）（详情参见下文）。

source: The initial section of this preference is related to where you pull the runtime tools from and requires you to input a URL to an RSS feed.
zh_cn: 这个偏好设置的初始部分是关于在哪里拉取运行库工具，需要你将网址输入到RSS订阅源。

source: The initial setting for the show views button on opening a room
zh_cn: 在打开的房间中显示视野按钮的初始设置

source: The instance found beneath the mouse cursor will then have its information displayed in the Selected Instance window, where you can see it's built in and instance variables, the same as for the Instances window.
zh_cn: 在鼠标指针下的实例的信息会显示在Selected Instance窗口中。在此处你能看到它的内置信息和实例变量，与实例窗口是一样的。

source: The instance in the room can then be changed in the editor itself or through code, so that it can be scaled, or coloured, or have other details modified from the "base" object.
zh_cn: 然后可以在编辑器本身或通过代码更改房间中的实例，以便可以缩放或着色，或从“基础”物体修改其他详细信息。

source: The instance layer is where you place all the instances of the objects that you require for the game.
zh_cn: 实例层是用来放置游戏所需物体的所有实例的层。

source: The language or method that you use to create your projects will depend on your skill and your previous background history, and since everyone is different GameMaker Studio 2 aims to be as adaptable as possible to your different needs, offering two different options for you to create games:
zh_cn: 创建你的项目使用的语言或者方法取决于你的技能和你以前的技术背景，既然每个人都是不同的， GameMaker Studio 2致力于满足你的不同需求，为你打造游戏提供了两种不同的选项：

source: The larger this value compared to your game speed, the smoother your game will run and the more overhead you have for adding further things.
zh_cn: 与您的游戏速度相比，该值越大，您的游戏将可以运行越流畅，并有更多性能剩余来让您添加更多东西。

source: The last operator we want to look at is EOR (Exclusive OR, sometimes called XOR), this operator flips the bits set in both values.
zh_cn: 最后我们要看的运算符是 “异或（EOR，有时叫 XOR）” ，这个运算翻转位设置，当 两个位 相同时为 0，不同时为 1。

source: The left edge of the rectangle to check
zh_cn: 矩形的左边界。

source: The left position of the region of cells to copy from the source grid.
zh_cn: 从源栅格复制的单元格区域的左端位置

source: The length (number of array indices) to copy.
zh_cn: 待拷贝的长度（数组索引个数）。

source: The level of anti-aliasing filtering (0, 2, 4 or 8).
zh_cn: 抗锯齿滤镜的等级 (0, 2, 4 or 8)。

source: The link colour for floating chains in the room editor
zh_cn: 房间编辑器中浮动链的连接颜色

source: The link colour for workspace chains
zh_cn: 工作区链接的连接颜色?

source: The link colour workspace chains
zh_cn: 工作区节点链的连线颜色

source: The link given in the Android Preferences for the ARM toolchain is incorrect and does not exist.
zh_cn: Android 首选项 中指定的 ARM toolchain 目录不正确，并且不存在。

source: The link given in the Android Preferences for the Android NDK is incorrect and does not exist.
zh_cn: Android 首选项 中指定的 Android NDK 目录不正确，并且不存在。

source: The link given in the Android Preferences for the MIPS toolchain is incorrect and does not exist.
zh_cn: Android 首选项 中指定的 MIPS toolchain 目录不正确，并且不存在。

source: The link given in the Android Preferences for the x86 toolchain is incorrect and does not exist.
zh_cn: Android 首选项 中指定的 x86 toolchain 目录不正确，并且不存在。

source: The location of the yydebug file for the program to connect to
zh_cn: 程序连接的 yydebug 文件的位置

# The location you have chosen is unsafe. Are you sure you want to save to '{0}'?
source: The location you have chosen is unsafe.\n\nAre you sure you want to save to '{0}'?
zh_cn: 您所选位置不安全。\n\n你确定要保存到 '{0}'？

source: The main body of the report shows which objects and scripts have been affected and where, while at the end you can find a list of the scripts that have been created for your project.
zh_cn: 报告的主体展现了哪些物体和脚本及其哪个位置受到了影响，而在报告的记为您会看到一系列被创建到您项目中的脚本。

source: The main options are:
zh_cn: 主要选项有：

source: The main page has the following options:
zh_cn: 主要页面有以下选项：

source: The main project file '{0}' has changed.
zh_cn: 项目主要文件 '{0}' 已被修改。

source: The main section contains the following option:
zh_cn: 主要部分包括以下选项：

source: The manual is not currently localised for this language
zh_cn: 该帮助文档目前尚未针对此语言进行本地化

source: The matrix data as an array
zh_cn: 以数组形式存在的矩阵数据

source: The maximum amount of recently used actions to be displayed.
zh_cn: 最近使用动作的最大显示数目

source: The maximum height in pixels for the game window.
zh_cn: 游戏窗口的最大像素高度。

source: The maximum number of clients that can connect at once.
zh_cn: 一次性能连接客户端的最大数量。

source: The maximum size of the Toolbox action thumbnails.
zh_cn: 工具栏动作缩略图的最大尺寸

source: The maximum width in pixels for the game window.
zh_cn: 游戏窗口的最大像素宽度。

source: The messages you can change are:
zh_cn: 你可以更改的消息包括：

source: The milliseconds in which a transfer from a server will timeout.
zh_cn: 从服务端获取传输的超时毫秒数。

source: The milliseconds in which a transfer to a server will timeout.
zh_cn: 向服务端发送传输的超时毫秒数。

source: The minimum height in pixels for the game window.
zh_cn: 游戏窗口的最小像素高度。

source: The minimum size of the Toolbox action thumbnails.
zh_cn: 工具栏动作缩略图的最小尺寸

source: The minimum width in pixels for the game window.
zh_cn: 游戏窗口的最小像素宽度。

source: The most general ones are listed on the main page while many others are split into multiple sub-categories, explained further down this page.
zh_cn: 最常规的几项已经被列在主页上，而其他的项目被分到多个的子目录下，我们会在后文深入解释。

source: The most important thing to note with the Free version of the product is that while you can test games on your machines, you cannot create final executable packages for any target platform.
zh_cn: 最值得注意的是，使用试用版的许可信息你可以在你的机器上测试>游戏，但是不能在任意一个目标平台上创建最终的可执行程序包。.

source: The most important thing to note with the Trial Licence of the product is that while you can test games on your machines, you cannot create final executable packages for any target platform.
zh_cn: 最值得注意的是，使用试用版的许可信息你可以在你的机器上测试游戏，但是不能在任意一个目标平台上创建最终的可执行程序包。.

source: The name assigned to this worker
zh_cn: 分配给此工作者的名称

source: The name of the canvas element to link the surface to.
zh_cn: 所链接的画布元素名称。

source: The name of the global variable to check for (as a string)
zh_cn: 待检测的全局变量名称（字符串形式）

source: The name of the global variable to get (as a string)
zh_cn: 待取得的全局变量名称（字符串形式）

source: The name of the saved image file.
zh_cn: 保存的图像文件的名称。

source: The named variable cannot be found in the current compile (for more information on variables see here)
zh_cn: 在当前编译中找不到指定的变量（有关变量的更多信息，请参阅 这里）

source: The network protocol to use
zh_cn: 所使用的网络协议

source: The new height of the window.
zh_cn: 窗口的新高度。

source: The new value for all grid cells.
zh_cn: 待叠加到栅格内所有单元格的值

source: The new width of the window.
zh_cn: 窗口的新宽度。

source: The new x coordinate of the window.
zh_cn: 窗口的新的x坐标。

source: The new y coordinate of the window.
zh_cn: 窗口的新的y坐标。

source: The next part of this guide will look at the Room Editor, where everything you've learned so far comes together to make your projects into games...
zh_cn: 本指南的下一部分将着眼于 房间编辑器，在这里您学到的所有东西都将汇聚在一起，使您的项目真正成为游戏。

source: The notification message text (a string)
zh_cn: 通知的正文(字符串格式)

source: The notification title (a string)
zh_cn: 通知的标题 (字符串格式)

source: The number 23 is actually made up of 1+2+4+16 or 00010111.
zh_cn: 数字 23 实际上由 1 + 2 + 4 + 16 或者 00010111 组成。

source: The number of particles to create.
zh_cn: 要创建粒子的数量。

source: The object that should have its event triggered.
zh_cn: 要触发事件的物体。

source: The option available here controls the message that pops up when you change the cell size of the tile set and this will affect how the room tilemap layers are rendered (resulting in cropped layers).
zh_cn: 此处的选项用来控制在更改图块集的单元格大小时所弹出的消息，这将影响如何渲染房间图块地图图层（这会导致裁剪图层）。

source: The option available here controls the message that pops up when you import a new image and one already exists.
zh_cn: 这里可用的选项控制导入新图片或者已经存在一个时弹出的信息。

source: The options above are the main options available from the General preferences, but there are a number of extra options available to you in the sub-categories listed below:
zh_cn: 上述这些选项是在常规（General）偏好设置里可用的主要项目，但在下面列出的子目录中还有一些额外选项：

source: The options are:
zh_cn: 选项有：

source: The options available are:
zh_cn: 可用的选项有：

source: The options available here control the messages that pop up when are required to confirm an action.
zh_cn: 此处可用选项用于控制在导入新图像时弹出的消息。 默认情况下，系统将提示您继续导入并覆盖现有图像或取消操作。

source: The options for GML are as follows:
zh_cn: GML的选项如下所示

source: The options here are:
zh_cn: 有如下选项:

source: The options in this menu are as follows:
zh_cn: 该菜单有如下选项：

source: The options section defines the different property options for your object and how the instances will behave when placed in a room.
zh_cn: 选项部分定义对象的不同属性选项，以及实例在放置在房间中时的行为方式。

source: The origin is simply the point that will be used to "anchor" our sprite within the room, and in this case we want to set it to the centre.
zh_cn: 原点用于设置将我们的精灵“锚定”在房间内的位置，在现在的情境下，我们希望将其设置在中心。

source: The other features of the sprite editor we'll discuss at the end of this section, but first we need to explain how to draw a sprite.
zh_cn: 我们将在本节的最后讨论精灵编辑器的其他功能，但首先我们需要解释如何绘制精灵。

source: The other options for an object are:
zh_cn: 对象的其他选项是：

source: The other settings are "No", to simply do nothing if the shortcut is used, or "Okay" to close the tab without any message.
zh_cn: 另一个选项为“否”（No），如果快捷键被使用了，则可能什么也不做或者确认关闭选项卡而不显示任何信息。

source: The pages listed here are provided as a "quick start" to get you up and running with GameMaker Studio 2.
zh_cn: 这里列出了“快速入门” GameMaker Studio 2 的章节。

source: The particle system that the emitter is in.
zh_cn: 发射器所处的粒子系统。

source: The particle system to create the emitter in.
zh_cn: 要在其中创建发射器的粒子系统。

source: The particle system to destroy all emitters from.
zh_cn: 要删除所有发射器的粒子系统。

source: The particle system to destroy the emitter from.
zh_cn: 待销毁发射器的粒子系统。

source: The password is created when you first create the *.pem file (see Create A New Certificate, below) and will be irreversibly linked to the certificate file created.
zh_cn: 密码是在你第一次创建*.pem文件的时候被创建的（见下文创建一个新证书（Create A New Certificate））并且会不可逆地被关联到所创建的证书文件上。

source: The path for the Nintendo Switch SDK is misconfigured
zh_cn: Nintendo Switch SDK 的路径配置错误

source: The path layer is the only one that does not actually get rendered when you run your game.
zh_cn: 路径层是唯一一个在运行游戏时不会实际渲染的层。

source: The path rotation sensitivity
zh_cn: 路径旋转敏感度

source: The path scale sensitivity
zh_cn: 路径缩放敏感度

source: The path to the Android NDK cannot be found.
zh_cn: 找不到 Android NDK 的路径。

source: The path to the Android SDK cannot be found.
zh_cn: 找不到 Android SDK 的路径。

source: The path to the Java JDK cannot be found.
zh_cn: 找不到 Java JDK 的路径。

source: The port number to use for the help web server
zh_cn: 帮助文档Web服务端的端口号

source: The port that the server will use.
zh_cn: 服务端所使用的端口。

source: The port the debugger should connect to
zh_cn: 调试器应连接的端口

source: The port to connect to
zh_cn: 待连接的端口

source: The port to connect to.
zh_cn: 待连接的端口。

source: The port to use
zh_cn: 待使用的端口

source: The possibilities are endless!
zh_cn: 它有无限种可能性！

source: The precision (in pixels) needed to insert a point on a path segment
zh_cn: 路径段上插入一个点需要的精度（像素）

source: The preferences here are for Go To window, which you can open using the keyboard shortcut + T.
zh_cn: 此处的偏好设置是用于前往（Go To）窗口的，你可以用键盘快捷键 + T打开它。

source: The preferences here are for Go To window, which you can open using the keyboard shortcut / + T.
zh_cn: 这里的偏好设置是 前往 窗口，可以使用键盘快捷键 / + T 打开。

source: The preferences here are related to the GameMaker Studio 2 Debugger and you have the following options:
zh_cn: 这里的偏好与 GameMaker Studio 2 调试器有关，有如下选项：

source: The preferences here contain options for how certain resources will be drawn in your projects:
zh_cn: 此处的设置包含了某些资源该如何在工程中被绘制出来。

source: The preferences here contain options for how the Recent Windows list will display items:
zh_cn: 这里的偏好设置包含 最近窗口 列表将如何显示项目:

source: The preferences here will affect how you move around within the different GameMaker Studio 2 workspaces.
zh_cn: 此处的设置将影响到你能如何在GameMaker Studio 2各个工作区之间游动浏览。

source: The project '{0}' cannot be loaded with GameMaker Studio 2 Trial
zh_cn: GameMaker Studio 2 试用版无法加载项目'{0}'

source: The project '{0}' cannot be loaded with the Trial license.
zh_cn: 试用版许可证下，这个项目 '{0}' 无法载入。

source: The project '{0}' does not exist and cannot be opened.
zh_cn: 项目 '{0}' 不存在，无法打开。

source: The project '{0}' has been deleted.
zh_cn: 工程 '{0}' 已被删除。

source: The project file '{0}' was deleted.
zh_cn: 项目文件 '{0}' 已经删除。

source: The project name '{0}' contains the following unsupported characters: '{1}'.\nPlease try a different name.
zh_cn: 项目名称'{0}'包含如下不支持的字符：'{1}'。\n请尝试其他命名。.

source: The properties frame colour for locked items in the room editor
zh_cn: 房间编辑器锁定项属性框颜色
